4rfc        IDENTIFICATION DIVISION.   
       PROGRAM-ID.    EX02.
       AUTHOR.        Leticia Candido,
       INSTALLATION.  FATECSP.
       DATE-WRITTEN.  13/11/2023.
       DATE-COMPILED.
       SECURITY.	APENAS O AUTOR PODE MODIFICAR.

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER. lettyPC.
       OBJECT-COMPUTER. lettyPC.
       SPECIAL-NAMES.   DECIMAL-POINT IS COMMA.

       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
       SELECT CADENT ASSIGN TO DISK 
       ORGANIZATION IS LINE SEQUENTIAL.
       SELECT TRAB ASSIGN TO DISK.
       SELECT CADSAI ASSIGN TO DISK 
       ORGANIZATION IS LINE SEQUENTIAL.

       DATA DIVISION.
       FILE SECTION.

       FD CADENT
            LABEL RECORD ARE STANDARD 
            VALUE OF FILE-ID IS "CADENT.DAT".

       01 CAD-ENT.
           02 CODIGO-ENT   PIC 9(05).
           02 NOME-ENT     PIC X(30).
           02 SEXO-ENT     PIC X(01).

       SD TRAB.

       01 REG-TRAB.
           02 CODIGO-TRAB  PIC 9(05).
           02 NOME-TRAB    PIC x(30).

       FD CADSAI
           LABEL RECORD ARE STANDARD 
           VALUE OF FILE-ID IS "CADSAI.DAT".

       01 CAD-SAI.
           02 CODIGO-SAI   PIC 9(05).
           02 NOME-SAI     PIC X(30).

       WORKING-STORAGE SECTION.
           77 FIM-ARQ PIC X(03) VALUE "NAO".

       PROCEDURE DIVISION.
       EM03-EXERC02.

       SORT TRAB
            DESCENDING KEY CODIGO-TRAB
            INPUT PROCEDURE ROT-ENTRADA
            GIVING CADSAI.
       STOP RUN.

       ROT-ENTRADA SECTION.
              PERFORM INICIO.
              PERFORM PRINCIPAL-ENTRADA UNTIL FIM-ARQ EQUAL "SIM".
              PERFORM FIM.

       INICIO SECTION.
              OPEN INPUT CADENT.
              PERFORM VERIFICA-FIM.

       VERIFICA-FIM SECTION.
              READ CADENT AT END MOVE 1 TO FIM-ARQ.

       PRINCIPAL-ENTRADA SECTION.
              PERFORM SELECAO.
              PERFORM VERIFICA-FIM.

       SELECAO SECTION.
              IF SEXO-ENT EQUAL "M" OR "m" PERFORM GRAVACAO.

       GRAVACAO SECTION.
              MOVE CODIGO-ENT TO CODIGO-TRAB.
              MOVE NOME-ENT TO NOME-TRAB.
              RELEASE REG-TRAB.

       FIM SECTION.
              CLOSE CADENT.
