       IDENTIFICATION DIVISION.
       PROGRAM-ID. EX5.
       AUTHOR. LETICIA CANDIDO.
       INSTALLATION. FATEC-SP.
       DATE-WRITTEN. 22/10/23.
       DATE-COMPILED. 22/10/23.
       SECURITY. APENAS O AUTOR PODE MODIFICAR. 

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER. IBM-PC.
       OBJECT-COMPUTER. IBM-PC.
       SPECIAL-NAMES. DECIMAL-POINT IS COMMA.

       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT ARQALU ASSIGN TO DISK
           ORGANIZATION IS LINE SEQUENTIAL.
           SELECT ARQREP ASSIGN TO DISK
           ORGANIZATION IS LINE SEQUENTIAL.
           SELECT RELAPROV ASSIGN TO DISK.


       DATA DIVISION.
       FILE SECTION.

       FD ARQALU
           LABEL RECORD ARE STANDARD
           VALUE OF FILE-IS IS "ARQALU.DAT".

       01 REG-ALU.
           02 MATR-ENT  PIC 9(7).
           02 NOME-ENT PIC X(30).
           02 NOTA1-ENT PIC 9(2)V9(2).
           02 NOTA2-ENT PIC 9(2)V9(2).
           02 NOTA3-ENT PIC 9(2)V9(2).
           02 FALTAS-ENT PIC 9(2).
           02 SEXO-ENT PIC X(1).
       
       FD ARQREP
           LABEL RECORD ARE STANDARD
           VALUE OF FILE-IS IS "ARQALU".

       01 REG-REP.
           02 MATR-SAI  PIC 9(7).
           02 NOME-SAI PIC X(30).
           02 NOTA1-SAI PIC 9(2)V9(2).
           02 NOTA2-SAI PIC 9(2)V9(2).
           02 NOTA3-SAI PIC 9(2)V9(2).
           02 FALTAS-SAI PIC 9(2).
           02 SEXO-SAI PIC X(1).

       FD RELAPROV
           LABEL RECORD IS OMITTED.
       01 REG-REL
           PIC X(100).

       WORKING-STORAGE SECTION.
           77 FIM-ARQ PIC X(03) VALUE "NAO".
           77 CT-LIN PIC 9(02) VALUE 30.
           77 CT-PAG PIC 9(02) VALUE ZEROES.
           77 MEDIA PIC 9(2)V9(2).
           77 SOMA PIC 9(2)V9(2).
           77 TOTALALUNOAPROV PIC 9(5).
           77 SOMAMEDIA PIC 9(2)V99.
           77 MEDIA-GERAL PIC 9(2)V99.

       01 CAB-01.
           02 FILLER PIC X(24) VALUE SPACES.
           02 FILLER PIC X(27) VALUE "RELACAO DE ALUNOS APROVADOS".
           02 FILLER PIC X(39) VALUE SPACES.
           02 FILLER  PIC X(05) VALUE "PAG. ".
           02 VAR-PAG PIC 99.
           02 FILLER  PIC X(03) VALUE SPACES.
       01 CAB-02.
           02 FILLER PIC X(10) VALUE SPACES.
           02 FILLER PIC X(06) VALUE "NUMERO".
           02 FILLER PIC X(20) VALUE SPACES.
           02 FILLER PIC X(13) VALUE "NOME DO ALUNO".
           02 FILLER PIC X(15) VALUE SPACES.
           02 FILLER PIC X(05) VALUE "MEDIA".
           02 FILLER PIC X(15) VALUE SPACES.
           02 FILLER PIC X(06) VALUE "FALTAS".
           02 FILLER PIC X(10) VALUE SPACES.
       01 DETALHE.
           02 FILLER PIC X(10).
           02 NUM PIC 9(7).
           02 FILLER PIC X(10) VALUE SPACES.
           02 NOM PIC X(30).
           02 FILLER PIC X(10) VALUE SPACES.
           02 MED PIC 9(2)V99.
           02 FILLER PIC X(20) VALUE SPACES.
           02 FAL PIC 99.
           02 FILLER PIC X(31) VALUE SPACES.
      01 DETALHE-TOTAL-ALUNO-APROVADOS.
           02 FILLER PIC X(28) VALUE "Total de alunos aprovados: ".
           02 TOTALALU PIC 9(05).
       01 DETALHE-MEDIA-TURMA.
           02 FILLER PIC X(22) VALUE "Media geral da turma: ".
           02 MEDIATUR PIC 9(2)V9(02).

       PROCEDURE DIVISION.
       EX5.
           PERFORM INICIO.
           PERFORM PRINCIPAL UNTIL FIM-ARQ EQUAL "SIM".
           PERFORM TOTAL-ALUNOS.
           PERFORM FIM.
           STOP RUN.

       INICIO.
           OPEN INPUT ARQALU
                OUTPUT ARQREP
                OUTPUT RELAPROV.
           PERFORM LEITURA.

       LEITURA.
           READ ARQALU AT END MOVE "SIM" TO FIM-ARQ.

       PRINCIPAL.
           PERFORM IMPRESSAO.
           PERFORM LEITURA. 
       IMPRESSAO.
           ADD NOTA1-ENT TO SOMA.
           ADD NOTA2-ENT TO SOMA.
           ADD NOTA3-ENT TO SOMA.
           DIVIDE SOMA BY 3 GIVING MEDIA.
           IF MEDIA GREATER THAN OR EQUAL TO 7 AND FALTAS-ENT LESS THAN
           OR EQUAL TO 16 
               PERFORM IMPRESSAO-ALUNO
           ELSE
               PERFORM GRAVACAO-ALUNO
           END-IF.

       IMPRESSAO-ALUNO.
           IF CT-LIN GREATER THAN 29
               PERFORM CABECALHO.
           PERFORM IMPRESSAO-DETALHE.
       
       GRAVACAO-ALUNO.
           MOVE MATR-ENT TO MATR-SAI.
           MOVE NOME-ENT TO NOME-SAI.
           MOVE NOTA1-ENT TO NOTA1-SAI.
           MOVE NOTA2-ENT TO NOTA2-SAI.
           MOVE NOTA3-ENT TO NOTA3-SAI.
           MOVE FALTAS-ENT TO FALTAS-SAI.
           MOVE SEXO-ENT TO SEXO-SAI.
           WRITE REG-REP.

       CABECALHO.
           ADD 1 TO CT-PAG.
           MOVE CT-PAG TO VAR-PAG.
           MOVE SPACES TO REG-REL.
           WRITE REG-REL AFTER ADVANCING PAGE.
           WRITE REG-REL FROM CAB-01 AFTER ADVANCING 1 LINE.
           WRITE REG-REL FROM CAB-02 AFTER ADVANCING 2 LINE.
           MOVE ZEROES TO CT-LIN.

       IMPRESSAO-DETALHE.   
           MOVE MATR-ENT TO NUM.
           MOVE NOME-ENT TO NOM.
           MOVE MEDIA TO MED.
           MOVE FALTAS-ENT TO FAL.
           WRITE REG-REL FROM DETALHE AFTER ADVANCING 1 LINE.
           ADD 1 TO CT-LIN.
           ADD 1 TO TOTALALUNOAPROV.
           ADD MEDIA TO SOMAMEDIA.

       TOTAL-ALUNOS.
           DIVIDE SOMAMEDIA BY TOTALALUNOAPROV GIVING MEDIA-GERAL.
           MOVE TOTALALUNOAPROV TO TOTALALU.
           MOVE MEDIA-GERAL TO MEDIATUR.
           WRITE REG-REL 
               FROM DETALHE-TOTAL-ALUNO-APROVADOS AFTER ADVANCING 2 
               LINES.
           WRITE REG-REL
               FROM DETALHE-MEDIA-TURMA AFTER ADVANCING 1 LINES.

       FIM.
           CLOSE ARQALU ARQREP RELAPROV.
