       IDENTIFICATION DIVISION.   
       PROGRAM-ID.    EX01.
       AUTHOR.        Leticia Candido.
       INSTALLATION.  FATEC-SP.
       DATE-WRITTEN.  12/11/2023.
       DATE-COMPILED.
       SECURITY.      APENAS O AUTOR PODE MODIFICAR

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER. lettyPC.
       OBJECT-COMPUTER. lettyPC.
       SPECIAL-NAMES.   DECIMAL-POINT IS COMMA.

       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
       SELECT CADENT ASSIGN TO DISK 
       ORGANIZATION IS LINE SEQUENTIAL.
       SELECT TRAB ASSIGN TO DISK.
       SELECT CADSAI ASSIGN TO DISK 
       ORGANIZATION IS LINE SEQUENTIAL.

       DATA DIVISION.
       FILE SECTION.
       FD CADENT
         LABEL RECORD ARE STANDARD 
         VALUE OF FILE-ID IS "CADENT.DAT".

       01 REG-ENT.
         02 COD-ENT   PIC 9(05).
         02 NOME-ENT  PIC X(30).
         02 SEXO-ENT  PIC X(01).

       SD TRAB.
       01 REG-TRAB.
         02 COD-TRAB  PIC 9(05).
         02 NOME-TRAB PIC X(30).
         02 SEXO-TRAB PIC X(01).

       FD CADSAI
         LABEL RECORD ARE STANDARD 
         VALUE OF FILE-ID IS "CADSAI.DAT".

       01 REG-SAI.
         02 COD-SAI  PIC 9(05).
         02 NOME-SAI PIC X(30).
         02 SEXO-SAI PIC X(01).
       
       WORKING-STORAGE SECTION.
       
       PROCEDURE DIVISION.
       EM03-EX01.

       SORT TRAB
              ASCENDING KEY COD-TRAB
              ASCENDING KEY NOME-TRAB
              USING CADENT
              GIVING CADSAI
       STOP RUN.
