       IDENTIFICATION DIVISION.
       PROGRAM-ID. EX3.
       AUTHOR. LETICIA CANDIDO.
       INSTALLATION. FATEC-SP.
       DATE-WRITTEN. 22/10/23.
       DATE-COMPILED. 22/10/23.
       SECURITY. APENAS O AUTOR PODE MODIFICAR. 

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER. IBM-PC.
       OBJECT-COMPUTER. IBM-PC.
       SPECIAL-NAMES. DECIMAL-POINT IS COMMA.

       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT CADENT ASSIGN TO DISK
           ORGANIZATION IS LINE SEQUENTIAL.
           SELECT RELSAI ASSIGN TO DISK.

       DATA DIVISION.
       FILE SECTION.

       FD CADENT
           LABEL RECORD ARE STANDARD
           VALUE OF FILE-IS IS "CADENT".

       01 REG-ENT.
           02 CODIGO-ENT  PIC 9(7).
           02 NOME-ENT PIC X(30).
           02 SALARIO-ENT PIC 9(5)V9(2).
           02 SEXO-ENT PIC X(1).
       
       FD RELSAI
           LABEL RECORD IS OMITTED.

       01 REG-REL
           PIC X(100).

       WORKING-STORAGE SECTION.
           77 FIM-ARQ PIC X(03) VALUE "NAO".
           77 CT-LIN PIC 9(02) VALUE 20.
           77 CT-PAG PIC 9(02) VALUE ZEROES.
           77 TOTAL-CLIENTES PIC 9(6) VALUE ZEROES.
           77 TOTAL-SALARIO PIC 9(6)V9(02).

       01 CAB-01.
           02 FILLER  PIC X(90) VALUE SPACES.
           02 FILLER  PIC X(05) VALUE "PAG. ".
           02 VAR-PAG PIC 99.
           02 FILLER  PIC X(03) VALUE SPACES.
       01 CAB-02.
           02 FILLER PIC X(31) VALUE SPACES.
           02 FILLER PIC X(21) VALUE "LISTAGEM DOS CLIENTES".
           02 FILLER PIC X(01) VALUE SPACES.
           02 FILLER PIC X(16) VALUE "DO SEXO FEMININO".
           02 FILLER PIC X(31) VALUE SPACES.
       01 CAB-03.
           02 FILLER PIC X(32) VALUE SPACES.
           02 FILLER PIC X(12) VALUE "COM SALARIOS".
           02 FILLER PIC X(01) VALUE SPACES.
           02 FILLER PIC X(12) VALUE "SUPERIORES A".
           02 FILLER PIC X(01) VALUE SPACES.
           02 FILLER PIC X(08) VALUE "5.000,00".
           02 FILLER PIC X(34) VALUE SPACES.
       01 CAB-04.
           02 FILLER PIC X(20) VALUE SPACES.
           02 FILLER PIC X(06) VALUE "CODIGO".
           02 FILLER PIC X(25) VALUE SPACES.
           02 FILLER PIC X(06) VALUE "NOME".
           02 FILLER PIC X(30) VALUE SPACES.
           02 FILLER PIC X(08) VALUE "SALARIO".
           02 FILLER PIC X(05) VALUE SPACES.
       01 DETALHE.
           02 FILLER PIC X(20) VALUE SPACES.
           02 COD PIC 9(7).
           02 FILLER PIC X(20) VALUE SPACES.
           02 NOM PIC X(30).
           02 FILLER PIC X(10) VALUE SPACES.
           02 SAL PIC 9(5)V9(2).
           02 FILLER PIC X(8) VALUE SPACES.
       01 DETALHE-TOTAL-CLIENTES.
           02 FILLER PIC X(30) VALUE "Total de Clientes Impressos: ".
           02 TOTALCLI PIC 9(03).

       01 DETALHE-SALARIO-TOTAL.
           02 FILLER PIC X(18) VALUE "Total de Salario: ".
           02 TOTALSAL PIC 9(6)V9(02).

       PROCEDURE DIVISION.
       EX1.
           PERFORM INICIO.
           PERFORM PRINCIPAL UNTIL FIM-ARQ EQUAL "SIM".
           PERFORM TOTALCLIENTES.
           PERFORM FIM.
           STOP RUN.

       INICIO.
           OPEN INPUT CADENT
                OUTPUT RELSAI.
           PERFORM LEITURA.

       LEITURA.
           READ CADENT AT END MOVE "SIM" TO FIM-ARQ.

       PRINCIPAL.
           PERFORM IMPRESSAO.
           PERFORM LEITURA.

       IMPRESSAO.
           IF SEXO-ENT EQUAL TO "F" AND SALARIO-ENT GREATER OR EQUAL
           TO 5000
               PERFORM IMPRESSAO-CLIENTES
           END-IF.

       IMPRESSAO-CLIENTES.
           IF CT-LIN GREATER THAN 19
               PERFORM CABECALHO.
           PERFORM IMPRESSAO-DETALHE.

       CABECALHO.
           ADD 1 TO CT-PAG.
           MOVE CT-PAG TO VAR-PAG.
           MOVE SPACES TO REG-REL.
           WRITE REG-REL AFTER ADVANCING PAGE.
           WRITE REG-REL FROM CAB-01 AFTER ADVANCING 1 LINE.
           WRITE REG-REL FROM CAB-02 AFTER ADVANCING 2 LINE.
           WRITE REG-REL FROM CAB-03 AFTER ADVANCING 1 LINE.
           WRITE REG-REL FROM CAB-04 AFTER ADVANCING 3 LINE.
           MOVE ZEROES TO CT-LIN.

       IMPRESSAO-DETALHE.   
           MOVE CODIGO-ENT TO COD.
           MOVE NOME-ENT TO NOM.
           MOVE SALARIO-ENT TO SAL.
           WRITE REG-REL FROM DETALHE AFTER ADVANCING 1 LINE.
           ADD 1 TO CT-LIN.
           ADD 1 TO TOTAL-CLIENTES.
           ADD SALARIO-ENT TO TOTAL-SALARIO.

       TOTALCLIENTES.
           MOVE TOTAL-CLIENTES TO TOTALCLI.
           MOVE TOTAL-SALARIO TO TOTALSAL.
           WRITE REG-REL 
               FROM DETALHE-TOTAL-CLIENTES AFTER ADVANCING 2 LINES.
           WRITE REG-REL
               FROM DETALHE-SALARIO-TOTAL 
               AFTER ADVANCING 1 LINES.
       FIM.
           CLOSE CADENT RELSAI.
