       IDENTIFICATION DIVISION.
       PROGRAM-ID. EX01.
       AUTHOR. LETICIA CANDIDO.
       INSTALLATION. FATECSP.
       DATE-WRITTEN. 22/10/23.
       DATE-COMPILED. 22/10/23.
       SECURITY. APENAS O AUTOR PODE MODIFICAR.

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER. IBM-PC.
       OBJECT-COMPUTER. IBM-PC.
       SPECIAL-NAMES. DECIMAL-POINT IS COMMA.

       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT CADSOC1 ASSIGN TO DISK
           ORGANIZATION IS LINE SEQUENTIAL.
           SELECT CADSOC2 ASSIGN TO DISK
           ORGANIZATION IS LINE SEQUENTIAL.
           SELECT RELSOCIO ASSIGN TO DISK.

       DATA DIVISION.
       FILE SECTION.
       FD CADSOC1
           LABEL RECORDS ARE STANDARD 
           DATA RECORD IS REG-CADSOC1
           VALUE OF FILE-ID IS "CADSOC1.DAT".
           01 REG-CADSOC1.
               02 COD-PAG-ENT  PIC 9(02).
               02 NUM-SOC-ENT  PIC 9(06).
               02 NOME-SOC-ENT PIC X(30).
               02 VALOR-PAG-ENT PIC 9(09)V9(02).
       FD CADSOC2
           LABEL RECORD ARE STANDARD
          VALUE OF FILE-ID IS "CASOC2.DAT".
           01 REG-CADSOC2.
               02 NUM-SOC-SAI  PIC 9(06).
               02 NOME-SOC-SAI PIC X(30).
               02 VALOR-PAG-SAI PIC 9(09)V9(02).
       FD RELSOCIO
           LABEL RECORD IS OMITTED.
           01 REG-REL PIC X(80).

       WORKING-STORAGE SECTION.
           77 FIM-ARQ          PIC X(03) VALUE "NAO".
           77 CT-LIN           PIC 9(02) VALUE 30.
           77 CT-PAG           PIC 9(02) VALUE ZEROES.
           77 CH-ERRO          PIC X(03) VALUE "NAO".
           77 TOTALSOC         PIC 9(05) VALUE ZEROES.
           77 VALOR-ATRASADO   PIC 9(09)V9(02) VALUE ZEROES.

           01 CAB-01.
               02 FILLER PIC X(68) VALUE SPACES.
               02 FILLER PIC X(05) VALUE "PAG. ".
               02 VAR-PAG PIC 99.

           01 CAB-02.
               02 FILLER PIC X(24) VALUE SPACES.
               02 FILLER PIC X(17) VALUE "RELACAO DE SOCIOS".
               02 FILLER PIC X(01) VALUE SPACES.
               02 FILLER PIC X(09) VALUE "ATRASADOS".
           01 CAB-03.
               02 FILLER PIC X(15) VALUE "NUMERO DO SOCIO".
               02 FILLER PIC X(5) VALUE SPACES.
               02 FILLER PIC X(13) VALUE "NOME DO SOCIO".
               02 FILLER PIC X(23) VALUE SPACES.
               02 FILLER PIC X(18) VALUE "VALOR DO PAGAMENTO".

           01 DETALHE.
               02 NUMCOD PIC 9(06).
               02 FILLER PIC X(14) VALUE SPACES.
               02 NOMSOC PIC X(30).
               02 FILLER PIC X(6) VALUE SPACES.
               02 VARPAG PIC 9(09)V9(02).

           01 DETALHE-SOCIO-ATRASADO.
               02 FILLER PIC X(27) VALUE "Total de Socios Atrasados: ".
               02 TOTAL-SOCIO-ATRASADOS PIC 9(05).

           01 DETALHE-VALOR-TOTAL-ATRASADO.
               02 FILLER PIC X(23) VALUE "Valor Total Atrasados: ".
               02 VALOR-TOTAL-ATRASADO PIC 9(12)V9(02).

       PROCEDURE DIVISION.
           PERFORM INICIO.
           PERFORM PRINCIPAL UNTIL FIM-ARQ EQUAL "SIM".
           PERFORM TOTAL-ATRASADOS.
           PERFORM FIM.
           STOP RUN.

       INICIO.
           OPEN INPUT CADSOC1
                OUTPUT CADSOC2
                OUTPUT RELSOCIO.
           PERFORM LEITURA.

       LEITURA.
           READ CADSOC1 AT END MOVE "SIM" TO FIM-ARQ.

       PRINCIPAL.
           PERFORM IMPRESSAO.
           PERFORM LEITURA.

       IMPRESSAO.
           IF COD-PAG-ENT EQUAL TO 1
               PERFORM GRAVACAO-CADSOC
           ELSE IF COD-PAG-ENT EQUAL TO 2
               PERFORM IMPRESSAO-RELSOCIO
           END-IF.

       GRAVACAO-CADSOC.
           MOVE NUM-SOC-ENT TO NUM-SOC-SAI.
           MOVE NOME-SOC-ENT TO NOME-SOC-SAI.
           MOVE VALOR-PAG-ENT TO VALOR-PAG-SAI.
           WRITE REG-CADSOC2.

       IMPRESSAO-RELSOCIO.
           IF CT-LIN GREATER THAN 29
               PERFORM CABECALHO.
           PERFORM IMPRESSAO-DETALHE.

       CABECALHO.
           ADD 1 TO CT-PAG.
           MOVE CT-PAG TO VAR-PAG.
           MOVE SPACES TO REG-REL.
           WRITE REG-REL AFTER ADVANCING PAGE.
           WRITE REG-REL FROM CAB-01 AFTER ADVANCING 1 LINE.
           WRITE REG-REL FROM CAB-02 AFTER ADVANCING 2 LINES.
           WRITE REG-REL FROM CAB-03 AFTER ADVANCING 2 LINES.
           MOVE ZEROES TO CT-LIN.

       IMPRESSAO-DETALHE.   
           MOVE NUM-SOC-ENT TO NUMCOD.
           MOVE NOME-SOC-ENT TO NOMSOC.
           MOVE VALOR-PAG-ENT TO VARPAG.
           WRITE REG-REL FROM DETALHE AFTER ADVANCING 1 LINE.
           ADD 1 TO CT-LIN.
           ADD 1 TO TOTALSOC.
           ADD VALOR-PAG-ENT TO VALOR-ATRASADO.

       TOTAL-ATRASADOS.
           MOVE TOTALSOC TO TOTAL-SOCIO-ATRASADOS.
           MOVE VALOR-ATRASADO TO VALOR-TOTAL-ATRASADO.
           WRITE REG-REL 
               FROM DETALHE-SOCIO-ATRASADO AFTER ADVANCING 2 LINES.
           WRITE REG-REL
               FROM DETALHE-VALOR-TOTAL-ATRASADO 
               AFTER ADVANCING 1 LINES.
       FIM.   
           CLOSE CADSOC1 CADSOC2 RELSOCIO.


